from tensorflow.keras.preprocessing.text import Tokenizer
import numpy as np
import pandas as pd


text1 = '나는 지금 진짜 진짜 매우 매우 맛있는 김밥을 엄청 마구 마구 마구 마구 먹었다.'
text2 = '개똥이는 기관사를 좋아힌다. 말똥이는 잘생겼다. 길동이는 마구 마구 더 잘생겼다.'

token = Tokenizer()  # 인스턴스(객체) = 클래스(), 인스턴스 생성 -----> 클래스를 정의했다. 통상 영어 대문자로 시작하면 클래스라고 한다.
token.fit_on_texts([text1, text2])

# print(token.word_index)
# {'마구': 1, '진짜': 2, '매우': 3, '잘생겼다': 4, '나는': 5, '지금': 6, '맛있는': 7, '김밥을': 8, '엄청': 9, '먹었다': 10, '개똥이는': 11, '기관사를': 12, '좋아힌다': 13, '말똥이는': 14, '길동이는': 15, '더': 16}

x = token.texts_to_sequences([text1, text2])
# print(x, x.shape)
# [[5, 6, 2, 2, 3, 3, 7, 8, 9, 1, 1, 1, 1, 10], [11, 12, 13, 14, 4, 15, 1, 1, 16, 4]]

x = np.concatenate(x).reshape(-1)  # 두개 이상의 리스트를 한 곳에 묶어서 OneHot_Encoding을 하기 위함이다.
# print(x, x.shape)  # (24,)
# [ 5  6  2  2  3  3  7  8  9  1  1  1  1 10 11 12 13 14  4 15  1  1 16  4]

x = pd.get_dummies(x, dtype=int)
print(x, x.shape)   # (24, 16)
#     1   2   3   4   5   6   7   8   9   10  11  12  13  14  15  16
# 0    0   0   0   0   1   0   0   0   0   0   0   0   0   0   0   0
# 1    0   0   0   0   0   1   0   0   0   0   0   0   0   0   0   0
# 2    0   1   0   0   0   0   0   0   0   0   0   0   0   0   0   0
# 3    0   1   0   0   0   0   0   0   0   0   0   0   0   0   0   0
# 4    0   0   1   0   0   0   0   0   0   0   0   0   0   0   0   0
# 5    0   0   1   0   0   0   0   0   0   0   0   0   0   0   0   0
# 6    0   0   0   0   0   0   1   0   0   0   0   0   0   0   0   0
# 7    0   0   0   0   0   0   0   1   0   0   0   0   0   0   0   0
# 8    0   0   0   0   0   0   0   0   1   0   0   0   0   0   0   0
# 9    1   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0
# 10   1   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0
# 11   1   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0
# 12   1   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0
# 13   0   0   0   0   0   0   0   0   0   1   0   0   0   0   0   0
# 14   0   0   0   0   0   0   0   0   0   0   1   0   0   0   0   0
# 15   0   0   0   0   0   0   0   0   0   0   0   1   0   0   0   0
# 16   0   0   0   0   0   0   0   0   0   0   0   0   1   0   0   0
# 17   0   0   0   0   0   0   0   0   0   0   0   0   0   1   0   0
# 18   0   0   0   1   0   0   0   0   0   0   0   0   0   0   0   0
# 19   0   0   0   0   0   0   0   0   0   0   0   0   0   0   1   0
# 20   1   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0
# 21   1   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0
# 22   0   0   0   0   0   0   0   0   0   0   0   0   0   0   0   1
# 23   0   0   0   1   0   0   0   0   0   0   0   0   0   0   0   0