from tensorflow.keras.preprocessing.text import Tokenizer

text = '나는 지금 진짜 진짜 매우 매우 맛있는 김밥을 엄청 마구 마구 마구 마구 먹었다.'

token = Tokenizer()  # 인스턴스(객체) = 클래스(), 인스턴스 생성 -----> 클래스를 정의했다. 통상 영어 대문자로 시작하면 클래스라고 한다.
token.fit_on_texts([text])

# print(token.word_index)
# {'마구': 1, '진짜': 2, '매우': 3, '나는': 4, '지금': 5, '맛있는': 6, '김밥을': 7, '엄청': 8, '먹었다': 9}

# print(token.word_counts)
# OrderedDict([('나는', 1), ('지금', 1), ('진짜', 2), ('매우', 2), ('맛있는', 1), ('김밥을', 1), ('엄청', 1), ('마구', 4), ('먹었다', 1)])

x = token.texts_to_sequences([text])   # 소문자는 통상 함수. -------> 함수의 값을 반환한다.
# print(x)
# [[4, 5, 2, 2, 3, 3, 6, 7, 8, 1, 1, 1, 1, 9]]


# exit()
############# OneHot Encoding 3개 만들기 #############

# #################### ONEHOT 1. to_categorical ####################
# from tensorflow.keras.utils import to_categorical 
# import numpy as np
# x = np.array(x).reshape(-1)           
# x = to_categorical(x)
# x = x[:, 1:]   # 0번째 컬럼 제거
# print(x, x.shape)    # (14, 9)
# [[0. 0. 0. 1. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 1. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 1. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 1. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 0. 1. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 0. 0. 1.]]
#################### ONEHOT 2. pandas ####################
# import pandas as pd
# import numpy as np
# x = np.array(x).reshape(-1)
# x = pd.get_dummies(x, dtype=int)
# print(x, x.shape)   # (14, 9)
#     1  2  3  4  5  6  7  8  9
# 0   0  0  0  1  0  0  0  0  0
# 1   0  0  0  0  1  0  0  0  0
# 2   0  1  0  0  0  0  0  0  0
# 3   0  1  0  0  0  0  0  0  0
# 4   0  0  1  0  0  0  0  0  0
# 5   0  0  1  0  0  0  0  0  0
# 6   0  0  0  0  0  1  0  0  0
# 7   0  0  0  0  0  0  1  0  0
# 8   0  0  0  0  0  0  0  1  0
# 9   1  0  0  0  0  0  0  0  0
# 10  1  0  0  0  0  0  0  0  0
# 11  1  0  0  0  0  0  0  0  0
# 12  1  0  0  0  0  0  0  0  0
# 13  0  0  0  0  0  0  0  0  1
#################### ONEHOT 3. sklearn ####################
from sklearn.preprocessing import OneHotEncoder
import numpy as np
x = np.array(x).reshape(-1)
x = x.reshape(-1,1)
ohe = OneHotEncoder(sparse_output=False)
x = ohe.fit_transform(x)
# print(x, x.shape)   # (14, 9)
# [[0. 0. 0. 1. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 1. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 1. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 1. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 0. 1. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
#  [0. 0. 0. 0. 0. 0. 0. 0. 1.]]