import numpy as np
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense, LSTM, SimpleRNN, GRU, Dropout
from tensorflow.keras.callbacks import EarlyStopping, ModelCheckpoint, ReduceLROnPlateau
import time
from sklearn.model_selection import train_test_split



#1. 데이터
a = np.array(range(1,101))
x_predict = np.array(range(96,106))   # 101~106까지 찾자

size = 6

#  데이터를 reshape한 후, split_x 함수로 시계열 데이터로 변환
# (n, 10, 1) ----> (n, 5, 2)
# 결과 뽑는다.


# print(a.shape)      #(100,)
a = a.reshape(50,2)
# print(a.shape)   #(50, 2)

def split_x(dataset, size):           # 벡터 형태의 데이터 뿐만 아니라 매트릭스 형태의 데이터까지 알아서 짤라준다.
    aaa = []
    for i in range(len(dataset) - size +1) :
        subset = dataset[i : (i+size)]
        aaa.append(subset)
    return np.array(aaa)

bbb = split_x(a, size)

# print(bbb, bbb.shape)       #(45, 6, 2)
# [[[  1   2]
#   [  3   4]
#   [  5   6]
#   [  7   8]
#   [  9  10]
#   [ 11  12]]

#  [[  3   4]
#   [  5   6]
#   [  7   8]
#   [  9  10]
#   [ 11  12]
#   [ 13  14]]

#  [[  5   6]
#   [  7   8]
#   [  9  10]
#   [ 11  12]
#   [ 13  14]
#   [ 15  16]]

#  [[  7   8]
#   [  9  10]
#   [ 11  12]
#   [ 13  14]
#   [ 15  16]
#   [ 17  18]]

#  [[  9  10]
#   [ 11  12]
#   [ 13  14]
#   [ 15  16]
#   [ 17  18]
#   [ 19  20]]

#  [[ 11  12]
#   [ 13  14]
#   [ 15  16]
#   [ 17  18]
#   [ 19  20]
#   [ 21  22]]

#  [[ 13  14]
#   [ 15  16]
#   [ 17  18]
#   [ 19  20]
#   [ 21  22]
#   [ 23  24]]

#  [[ 15  16]
#   [ 17  18]
#   [ 19  20]
#   [ 21  22]
#   [ 23  24]
#   [ 25  26]]

#  [[ 17  18]
#   [ 19  20]
#   [ 21  22]
#   [ 23  24]
#   [ 25  26]
#   [ 27  28]]

#  [[ 19  20]
#   [ 21  22]
#   [ 23  24]
#   [ 25  26]
#   [ 27  28]
#   [ 29  30]]

#  [[ 21  22]
#   [ 23  24]
#   [ 25  26]
#   [ 27  28]
#   [ 29  30]
#   [ 31  32]]

#  [[ 23  24]
#   [ 25  26]
#   [ 27  28]
#   [ 29  30]
#   [ 31  32]
#   [ 33  34]]

#  [[ 25  26]
#   [ 27  28]
#   [ 29  30]
#   [ 31  32]
#   [ 33  34]
#   [ 35  36]]

#  [[ 27  28]
#   [ 29  30]
#   [ 31  32]
#   [ 33  34]
#   [ 35  36]
#   [ 37  38]]

#  [[ 29  30]
#   [ 31  32]
#   [ 33  34]
#   [ 35  36]
#   [ 37  38]
#   [ 39  40]]

#  [[ 31  32]
#   [ 33  34]
#   [ 35  36]
#   [ 37  38]
#   [ 39  40]
#   [ 41  42]]

#  [[ 33  34]
#   [ 35  36]
#   [ 37  38]
#   [ 39  40]
#   [ 41  42]
#   [ 43  44]]

#  [[ 35  36]
#   [ 37  38]
#   [ 39  40]
#   [ 41  42]
#   [ 43  44]
#   [ 45  46]]

#  [[ 37  38]
#   [ 39  40]
#   [ 41  42]
#   [ 43  44]
#   [ 45  46]
#   [ 47  48]]

#  [[ 39  40]
#   [ 41  42]
#   [ 43  44]
#   [ 45  46]
#   [ 47  48]
#   [ 49  50]]

#  [[ 41  42]
#   [ 43  44]
#   [ 45  46]
#   [ 47  48]
#   [ 49  50]
#   [ 51  52]]

#  [[ 43  44]
#   [ 45  46]
#   [ 47  48]
#   [ 49  50]
#   [ 51  52]
#   [ 53  54]]

#  [[ 45  46]
#   [ 47  48]
#   [ 49  50]
#   [ 51  52]
#   [ 53  54]
#   [ 55  56]]

#  [[ 47  48]
#   [ 49  50]
#   [ 51  52]
#   [ 53  54]
#   [ 55  56]
#   [ 57  58]]

#  [[ 49  50]
#   [ 51  52]
#   [ 53  54]
#   [ 55  56]
#   [ 57  58]
#   [ 59  60]]

#  [[ 51  52]
#   [ 53  54]
#   [ 55  56]
#   [ 57  58]
#   [ 59  60]
#   [ 61  62]]

#  [[ 53  54]
#   [ 55  56]
#   [ 57  58]
#   [ 59  60]
#   [ 61  62]
#   [ 63  64]]

#  [[ 55  56]
#   [ 57  58]
#   [ 59  60]
#   [ 61  62]
#   [ 63  64]
#   [ 65  66]]

#  [[ 57  58]
#   [ 59  60]
#   [ 61  62]
#   [ 63  64]
#   [ 65  66]
#   [ 67  68]]

#  [[ 59  60]
#   [ 61  62]
#   [ 63  64]
#   [ 65  66]
#   [ 67  68]
#   [ 69  70]]

#  [[ 61  62]
#   [ 63  64]
#   [ 65  66]
#   [ 67  68]
#   [ 69  70]
#   [ 71  72]]

#  [[ 63  64]
#   [ 65  66]
#   [ 67  68]
#   [ 69  70]
#   [ 71  72]
#   [ 73  74]]

#  [[ 65  66]
#   [ 67  68]
#   [ 69  70]
#   [ 71  72]
#   [ 73  74]
#   [ 75  76]]

#  [[ 67  68]
#   [ 69  70]
#   [ 71  72]
#   [ 73  74]
#   [ 75  76]
#   [ 77  78]]

#  [[ 69  70]
#   [ 71  72]
#   [ 73  74]
#   [ 75  76]
#   [ 77  78]
#   [ 79  80]]

#  [[ 71  72]
#   [ 73  74]
#   [ 75  76]
#   [ 77  78]
#   [ 79  80]
#   [ 81  82]]

#  [[ 73  74]
#   [ 75  76]
#   [ 77  78]
#   [ 79  80]
#   [ 81  82]
#   [ 83  84]]

#  [[ 75  76]
#   [ 77  78]
#   [ 79  80]
#   [ 81  82]
#   [ 83  84]
#   [ 85  86]]

#  [[ 77  78]
#   [ 79  80]
#   [ 81  82]
#   [ 83  84]
#   [ 85  86]
#   [ 87  88]]

#  [[ 79  80]
#   [ 81  82]
#   [ 83  84]
#   [ 85  86]
#   [ 87  88]
#   [ 89  90]]

#  [[ 81  82]
#   [ 83  84]
#   [ 85  86]
#   [ 87  88]
#   [ 89  90]
#   [ 91  92]]

#  [[ 83  84]
#   [ 85  86]
#   [ 87  88]
#   [ 89  90]
#   [ 91  92]
#   [ 93  94]]

#  [[ 85  86]
#   [ 87  88]
#   [ 89  90]
#   [ 91  92]
#   [ 93  94]
#   [ 95  96]]

#  [[ 87  88]
#   [ 89  90]
#   [ 91  92]
#   [ 93  94]
#   [ 95  96]
#   [ 97  98]]

#  [[ 89  90]
#   [ 91  92]
#   [ 93  94]
#   [ 95  96]
#   [ 97  98]
#   [ 99 100]]]
# exit()
x = bbb[:, :-1,]
y = bbb[:, -1, -1]

print(x, y, x.shape, y.shape)     # (45, 5, 2) (45,)

exit()
#2. 모델구성
model = Sequential()
# model.add(GRU(64,input_shape=(5, 2)))            
# model.add(LSTM(64, input_shape=(5, 2)))        
model.add(SimpleRNN(64, input_shape=(5, 2), activation='linear'))   
model.add(Dense(16, activation='linear'))
model.add(Dense(8, activation='linear'))
model.add(Dense(1))


#3. 컴파일, 훈련
model.compile(loss='mse', optimizer='adam')

from tensorflow.keras.callbacks import EarlyStopping
es = EarlyStopping(
        monitor='loss',
        mode='min',
        patience=50,
        restore_best_weights=True,
)
start_time = time.time()                      
model.fit(x, y, 
        epochs = 1500,
        batch_size = 4,
        callbacks=[es],
)
end_time = time.time()

#4. 평가,예측
print('================= model.evaluate =================')
loss = model.evaluate(x, y)
print('loss :', loss) 
print('걸린시간 :', round(end_time - start_time, 2), '초')

x_predict = np.array([[91,93,95,97,99],[92,94,96,98,100]]).T.reshape(1,5,2)
y_predict = model.predict(x_predict)
result = model.predict(y_predict)
print('================= 101~106 예측 결과 =================')
print(result)

'''







'''